Documentation/Source/NotesForCoders.tex
\documentclass[captions=tablesignature]{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{booktabs}
\usepackage[scaled]{beraserif}
\usepackage[scaled]{berasans}
\usepackage[scaled]{beramono}
\usepackage[usenames,dvipsnames]{color}
\usepackage{fancyhdr}
\usepackage{subfig}
\usepackage{listings}
\lstnewenvironment{common-lispcode}
{\lstset{language={HTML},basicstyle={\ttfamily\footnotesize},frame=single,breaklines=true}}
{}
\usepackage{paralist}
\let\itemize\compactitem
\let\description\compactdesc
\let\enumerate\compactenum
\usepackage[letterpaper,includeheadfoot,top=12.5mm,bottom=25mm,left=19mm,right=19mm]{geometry}
\pagestyle{fancy}
\setcounter{secnumdepth}{3}
\author{Peter\thanks{NELA.Percy@gmail.com}}
\date{March 2010}
\title{Notes for Coders}
\hypersetup{
  pdfkeywords={Zambia, Documentation, FFF branch},
  pdfsubject={Zambia is a piece of Conference Management Software.  This document is a general guide assisting in the way of programming the Zambia FFF-branch, as inhereted from the main branch.},
  pdfcreator={}}
\begin{document}

\maketitle
\pagenumbering{roman}
\thispagestyle{fancy}
\renewcommand{\headrulewidth}{0pt}
\renewcommand{\footrulewidth}{0pt}
\lhead{}
\rhead{}
\chead{}
\lfoot{}
\cfoot{}
\rfoot{}
\begin{abstract}
\vspace{5cm}
{\LARGE{\textbf{Abstract:\\}}}

\end{abstract}
\newpage
\renewcommand{\headrulewidth}{1pt}
\renewcommand{\footrulewidth}{1pt}
\chead{
Notes for Coders
}
\lfoot{
Peter <NELA.Percy@gmail.com>
}
\rfoot{\thepage}
\setcounter{tocdepth}{3}
\tableofcontents
\newpage
\pagenumbering{arabic}
\section{Files}
\label{sec-1}
We need consistency, so here is the plan:
\subsection{contains configuration information that each conference should set: Local/db\_name.php}
\label{sec-1-1}

\subsection{contains css information: Common.css  ParticipantSection.css  StaffSection.css}
\label{sec-1-2}

\subsection{auto generated files that display a page (aka you can link to them)}
\label{sec-1-3}
lowercasewithnounderscores.php
\textbf{No Longer Used!}
\subsection{contains functions and constants that other pages use (not autogenerated)}
\label{sec-1-4}
lower\_with\_underscore\_functions.php
db\_functions.php           \# for database related functions
data\_functions.php
validate\_functions.php
render\_functions.php
\subsection{file that displays a page and can be linked to  (not autogenerated)}
\label{sec-1-5}
StrongCaps.php
BrainstormStrongCaps.php    \# for brainstorm pages
StaffStrongCaps.php    \# for staff only pages
ParticipantStrongCaps.php    \# for Participant only pages
CommonStrongCaps.php    \# pages used by at least 2 different groups
\subsection{file that processes a post operation, but calls a separate file to}
\label{sec-1-6}
display the results (deprecated?)
SubmitStongCaps.php
\subsection{file that processes a post operation and display the results}
\label{sec-1-7}
(often by calling a function that is elsewhere)
StrongCaps\_POST.php
\subsection{file that contains functions used by a page of the same name}
\label{sec-1-8}
(and not elsewhere.   If it is used elsewhere it needs to move)
StrongCaps\_FNC.php
\subsection{shell script for report generation: gencsv.sh genindex.sh genreports.sh}
\label{sec-1-9}

\section{Interesting hacks}
\label{sec-2}
\subsection{Presenter only}
\label{sec-2-1}
To end up with either a blank, or just the presenter (no aidedecamp, introducer, or volunteer) in a group\_concat use:
group\_concat(if(volunteer=0 and introducer=0 and aidedecamp=0,pubsname,NULL) SEPARATOR " - ") AS 'Participants' or
group\_concat(if(volunteer=0 and introducer=0 and aidedecamp=0,pubsname,NULL), if(moderator=1,' (M)','') order by moderator DESC, pubsname SEPARATOR " - ") AS 'Participants'
It's much easier and cleaner than doing the whole sub-SELECT thing, or limiting it with:
volunteer=0 AND introducer=0 AND aidedecamp=0
group\_concat(' ',P.pubsname, if(moderator=1,'  (M)','') order by moderator, pubsname

\subsection{Duration}
\label{sec-2-2}
This is what we have standardized on for the duration printing:
 CASE
   WHEN HOUR(duration) < 1 THEN
     concat(date\_format(duration,'\%i'),'min')
   WHEN MINUTE(duration)=0 THEN
     concat(date\_format(duration,'\%k'),'hr')
   ELSE
     concat(date\_format(duration,'\%k'),'hr ',date\_format(duration,'\%i'),'min')
   END AS Duration,

\subsection{Time compare}
\label{sec-2-3}
time\_to\_sec(starttime) < time\_to\_sec("19:30:00") compares two times.

\subsection{Row count}
\label{sec-2-4}
select @rownum:=@rownum+1 AS "Order", title from Sessions, (SELECT @rownum:=0) AS R
or with more complexity, and applicability:
concat("<INPUT type=$\backslash$"checkbox$\backslash$" name=$\backslash$"del",@rownum:=@rownum+1,"$\backslash$" value=$\backslash$"1$\backslash$">\n<INPUT type=$\backslash$"hidden$\backslash$" name=$\backslash$"row",@rownum,"$\backslash$" value=$\backslash$"",scheduleid,"$\backslash$"><INPUT type=$\backslash$"hidden$\backslash$" name=$\backslash$"rowsession",@rownum,"$\backslash$" value=$\backslash$"",sessionid,"$\backslash$">") AS "Delete",

\subsection{Previous con}
\label{sec-2-5}
LEFT JOIN (SELECT
               GROUP\_CONCAT(conid, " - ", interestedtypename) AS previous,
               badgeid
             FROM
                 \$ReportDB.Interested
               JOIN \$ReportDB.InterestedTypes USING (interestedtypeid)
             WHERE
                conid!=\$conid
              GROUP BY
                 badgeid) PV USING (badgeid)

\subsection{Alternate Roles}
\label{sec-2-6}
LEFT JOIN (SELECT
               email,
               GROUP\_CONCAT("<A HREF=StaffEditCreateParticipant.php?action=edit\&partid=",badgeid,">",permrolename,"</A>" SEPARATOR ", ") AS altrole
             UMFRAY
                 \$ReportDB.UserHasPermissionRole
               JOIN \$ReportDB.PermissionRoles USING (permroleid)
               JOIN \$ReportDB.CongoDump USING (badgeid)
             WHERE
               conid=\$conid AND
               permrolename NOT IN ('Vendor')
             GROUP BY
               badgeid) AR USING (email)

\subsection{Multi-select boxes}
\label{sec-2-7}
need the specail "close" button to work (from the javascript file)
as well as the mapping to a multi-box, and the "src" and "dest" set
up properly.  All expect the conid now, so that has to be ported.
The "SessionHas" can be in either for the nonce.  Check the
db\_functions and the data\_functions files as well, to make sure
those are going to work.
\end{document}
